In [1]:
#Importing the libraries
#import numpy as np
import pandas as pd

In [2]:
#Read the excel file into a Dataframe
df = pd.read_excel(r'D:\Sample Datasets\Raw_data.xlsx')
df

                                           Addr       Date     Name     Time
0  78 rd, kenith street, btm, bangalore, 500038 2022-04-03  Lavanya  8:45:23
1   45 rd,  maruthi street, hitech, Hyd, 500058 2022-06-07    Ramya  5:25:21
2     3 rd, royal street, Kondapur, Hyd, 500011 2022-08-09    Sudha  5:34:43

In [3]:
df['Addr'] #Shows the data present in the Addr column

0    78 rd, kenith street, btm, bangalore, 500038
1     45 rd,  maruthi street, hitech, Hyd, 500058
2       3 rd, royal street, Kondapur, Hyd, 500011
Name: Addr, dtype: object

In [4]:
df.shape

(3, 4)

In [5]:
df.isnull().any().any() #no null or missing values present - so it displays False

False

In [6]:
df.columns       #Shows the column names present

Index(['Addr', 'Date', 'Name', 'Time'], dtype='object')

In [7]:
#Splitting the Address column by commas or (by using any delimiters)
df[['House Addr','Street','City', 'State', 'Zip_code']] = df['Addr'].str.split(',', expand=True)

In [8]:
df

,Addr,Date,Name,Time,House Addr,Street,City,State,Zip_code
0,"78 rd, kenith street, btm, bangalore, 500038",2022-04-03,Lavanya,8:45:23,78 rd,kenith street,btm,bangalore,500038
1,"45 rd, maruthi street, hitech, Hyd, 500058",2022-06-07,Ramya,5:25:21,45 rd,maruthi street,hitech,Hyd,500058
2,"3 rd, royal street, Kondapur, Hyd, 500011",2022-08-09,Sudha,5:34:43,3 rd,royal street,Kondapur,Hyd,500011

In [9]:
# Strip any leading/trailing whitespace from the new columns
df['House Addr'] = df['House Addr'].str.strip()
df['Street'] = df['Street'].str.strip()
df['City'] = df['City'].str.strip()
df['State'] = df['State'].str.strip()
df['Zip_code'] = df['Zip_code'].str.strip()

In [10]:
#Dropping the original Addr column as its no longer needed
df.drop(columns=['Addr'], inplace=True)

In [11]:
df

,Date,Name,Time,House Addr,Street,City,State,Zip_code
0,2022-04-03,Lavanya,8:45:23,78 rd,kenith street,btm,bangalore,500038
1,2022-06-07,Ramya,5:25:21,45 rd,maruthi street,hitech,Hyd,500058
2,2022-08-09,Sudha,5:34:43,3 rd,royal street,Kondapur,Hyd,500011

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        3 non-null      datetime64[ns]
 1   Name        3 non-null      object
 2   Time        3 non-null      object
 3   House Addr  3 non-null      object
 4   Street      3 non-null      object
 5   City        3 non-null      object
 6   State       3 non-null      object
 7   Zip_code    3 non-null      object
dtypes: datetime64[ns](1), object(7)
memory usage: 324.0+ bytes

Series should be in datetime format. If it is not then convert it using pd.to_datetime(series)

- series.dt.year
- series.dt.day
- series.dt.month

- In the below example Date column i.e, date is already converted in datetime,
  Otherwise convert the 'Date' column to datetime
  
  df['Date'] = pd.to_datetime(df['Date'])
- Here,Time column is in the object dtype format so convert it into datetime format.

In [14]:
df['Date']  #Shows the data present in the Date column

0   2022-04-03
1   2022-06-07
2   2022-08-09
Name: Date, dtype: datetime64[ns]

In [15]:
#Dispalys the Month
df['Date'].dt.month

0    4
1    6
2    8
Name: Date, dtype: int32

In [16]:
#Displays the day
df['Date'].dt.day

0    3
1    7
2    9
Name: Date, dtype: int32

In [17]:
#Displays the Year
df['Date'].dt.year

0    2022
1    2022
2    2022
Name: Date, dtype: int32

In [18]:
df

,Date,Name,Time,House Addr,Street,City,State,Zip_code
0,2022-04-03,Lavanya,8:45:23,78 rd,kenith street,btm,bangalore,500038
1,2022-06-07,Ramya,5:25:21,45 rd,maruthi street,hitech,Hyd,500058
2,2022-08-09,Sudha,5:34:43,3 rd,royal street,Kondapur,Hyd,500011



**Explanation:**


.dt accessor: This provides various properties like day, month, year, hour, minute, second, etc., that you can directly extract from a datetime object.

Efficient and Flexible: Using .dt is the preferred approach for extracting date components from a datetime object because it’s specifically designed to work with datetime data types and is more efficient than using string manipulation methods like split().

In [20]:
#Splitting the Date column into different components
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df['Year'] = df['Date'].dt.year
df

,Date,Name,Time,House Addr,Street,City,State,Zip_code,Month,Day,Year
0,2022-04-03,Lavanya,8:45:23,78 rd,kenith street,btm,bangalore,500038,4,3,2022
1,2022-06-07,Ramya,5:25:21,45 rd,maruthi street,hitech,Hyd,500058,6,7,2022
2,2022-08-09,Sudha,5:34:43,3 rd,royal street,Kondapur,Hyd,500011,8,9,2022

In [21]:
#Dropping the original 'Date' column as its no longer needed
df.drop(columns=['Date'], inplace=True)

In [22]:
df

,Name,Time,House Addr,Street,City,State,Zip_code,Month,Day,Year
0,Lavanya,8:45:23,78 rd,kenith street,btm,bangalore,500038,4,3,2022
1,Ramya,5:25:21,45 rd,maruthi street,hitech,Hyd,500058,6,7,2022
2,Sudha,5:34:43,3 rd,royal street,Kondapur,Hyd,500011,8,9,2022

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Time        3 non-null      object
 2   House Addr  3 non-null      object
 3   Street      3 non-null      object
 4   City        3 non-null      object
 5   State       3 non-null      object
 6   Zip_code    3 non-null      object
 7   Month       3 non-null      int32
 8   Day         3 non-null      int32
 9   Year        3 non-null      int32
dtypes: int32(3), object(7)
memory usage: 336.0+ bytes

In [24]:
#Shows the data present in the Time column
df['Time']

0    8:45:23
1    5:25:21
2    5:34:43
Name: Time, dtype: object

Time column is in the object dtype format so convert it into datetime format.

In [26]:
df['Time'] = pd.to_datetime(df['Time'], format = '%H:%M:%S')

In [27]:
df

,Name,Time,House Addr,Street,City,State,Zip_code,Month,Day,Year
0,Lavanya,1900-01-01 08:45:23,78 rd,kenith street,btm,bangalore,500038,4,3,2022
1,Ramya,1900-01-01 05:25:21,45 rd,maruthi street,hitech,Hyd,500058,6,7,2022
2,Sudha,1900-01-01 05:34:43,3 rd,royal street,Kondapur,Hyd,500011,8,9,2022

In [28]:
#Hours extraction
df['Time'].dt.hour

0    8
1    5
2    5
Name: Time, dtype: int32

In [29]:
#Minutes extraction
df['Time'].dt.minute

0    45
1    25
2    34
Name: Time, dtype: int32

In [30]:
#Seconds extraction
df['Time'].dt.second

0    23
1    21
2    43
Name: Time, dtype: int32

In [31]:
#Splitting the Time column into different components
df['Hour'] = df['Time'].dt.hour
df['Minute'] = df['Time'].dt.minute
df['Second'] = df['Time'].dt.second
df

,Name,Time,House Addr,Street,City,State,Zip_code,Month,Day,Year,Hour,Minute,Second
0,Lavanya,1900-01-01 08:45:23,78 rd,kenith street,btm,bangalore,500038,4,3,2022,8,45,23
1,Ramya,1900-01-01 05:25:21,45 rd,maruthi street,hitech,Hyd,500058,6,7,2022,5,25,21
2,Sudha,1900-01-01 05:34:43,3 rd,royal street,Kondapur,Hyd,500011,8,9,2022,5,34,43

In [32]:
#Dropping the original 'Time' column as its no longer needed
df.drop(columns=['Time'], inplace=True)

In [33]:
df

,Name,House Addr,Street,City,State,Zip_code,Month,Day,Year,Hour,Minute,Second
0,Lavanya,78 rd,kenith street,btm,bangalore,500038,4,3,2022,8,45,23
1,Ramya,45 rd,maruthi street,hitech,Hyd,500058,6,7,2022,5,25,21
2,Sudha,3 rd,royal street,Kondapur,Hyd,500011,8,9,2022,5,34,43

In [34]:
# Moving 'name' column to be after 'zip-code'
cols = ['House Addr', 'Street', 'City', 'State', 'Zip_code', 'Name', 'Month', 'Day', 'Year', 'Hour', 'Minute', 'Second']
df = df[cols]
df

,House Addr,Street,City,State,Zip_code,Name,Month,Day,Year,Hour,Minute,Second
0,78 rd,kenith street,btm,bangalore,500038,Lavanya,4,3,2022,8,45,23
1,45 rd,maruthi street,hitech,Hyd,500058,Ramya,6,7,2022,5,25,21
2,3 rd,royal street,Kondapur,Hyd,500011,Sudha,8,9,2022,5,34,43

In [35]:
# Optionally, you can save the cleaned DataFrame to a new Excel file
df.to_excel(r'D:\Sample Datasets\Cleaned_Data.xlsx', index=False)